Repository: Applesmart/hueman-languages
Catalog: fullver._*.po
Languages: ru_ru

source: The CSS option type is a textarea that when used properly can add dynamic CSS to your theme from within OptionTree. Unfortunately, due server limitations you will need to create a file named <code>dynamic.css</code> at the root level of your theme and change permissions using chmod so the server can write to the file. I have had the most success setting this single file to 0777 but feel free to play around with permissions until everything is working. A good starting point is 0666. When the server can save to the file CSS will automatically be updated each time you save your theme options.
ru_ru: Параметр CSS является текстовым, что при правильном использовании может добавить динамический CSS к вашей теме изнутри Панели опций.К сожалению, из-за ограничений сервера вам необходимо создать файл с именем <code>dynamic.css<code> на корневом уровне вашей темы и изменять разрешения с использованием CHMOD поэтому сервер может записать в файл. Я имел наибольший успех Установка этого один файл на 0777, но не стесняйтесь играть с разрешениями, пока все не работает.Хорошей отправной точкой является 0666.Когда сервер может сохранить в файл CSS будет автоматически обновляется каждый раз, когда вы сохраняете настройки темы.

source: An example of the CSS option type: This assumes you have an option with the ID of <code>custom_background_css</code> which will display the saved values for that option.
ru_ru: Пример параметра CSS: Это предполагает, что у вас есть параметр с идентификатором <code>custom_background_css</code> которой будет показывать сохраненные значения для этого параметра.

source: Input
ru_ru: Ввод

source: Output
ru_ru: Вывод

source: Custom Post Type Select
ru_ru: Выбрать пользовательский тип сообщения

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It will return a single post ID for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
ru_ru: Параметр типа Выбор Пользовательской Записи отображает список Идентификаторов из любого доступного типа записи в WordPress, либо пользовательский. Он вернет один индентификатор поста для использования в пользовательской функции или цикле. В созданных настройкахтребуется по крайней мере один доступный <code>post_type</code>. По какой-то причине <code>any</code> не работает правильно, и в будущем постараемся исправить.

source: Custom Post Type Checkbox
ru_ru: Пометить пользовательский тип сообщения

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It allows the user to check multiple post IDs for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
ru_ru: Параметр типа Выбор Пользовательской Записи отображает список Идентификаторов из любого доступного типа записи в WordPress, либо пользовательский. Это позволяет пользователю проверить несколько индентификатор поста для использования в пользовательской функции или цикле. В созданных настройкахтребуется по крайней мере один доступный <code>post_type</code>. По какой-то причине <code>any</code> не работает правильно, и в будущем постараемся исправить.

source: List Item
ru_ru: Элемент Списка

source: The list Item replaced the old Slider option type. It allows for a great deal of customization. You can add settings to the List Item and those settings will be displayed to the user when they add a new List Item. Typical use is for creating sliding content or blocks of code for custom layouts.
ru_ru: Список элементов заменил старый тип параметра Slider. Это позволяет приметь больше настроек. Вы можете добавить настройки к списку элементов и эти установки будут видны пользователю при образовании новых элементов списка. Обычно используется для создания скользящего (чередующегося) контента или блоков кода пользовательских макетов.

source: Measurement
ru_ru: Измерение

source: The Measurement option type is a mix of input and select fields. The text input excepts a value and the select lets you choose the unit of measurement to add to that value. Currently the default units are <code>px</code>, <code>%</code>, <code>em</code>, <code>pt</code>. However, you can change them with the <code>ot_measurement_unit_types</code> filter.
ru_ru: Параметр Измерение это сочетание областей ввода текста и выборки. Вводимый текст исключает присвоение значения, а выборка позволяет вам выбрать единицу измерения для этого значения. По умолчанию установлены следующие единицы измерения <code>px</code>, <code>%</code>, <code>em</code>, <code>pt</code>. Тем не менее, вы можете изменить их с помощью фильтра <code>ot_measurement_unit_types</code>.

source: Example filter to add new units to the Measurement option type. Added to <code>functions.php</code>.
ru_ru: Пример фильтра для добавления новых единиц параметра Измерения. Может быть добавлено в <code>functions.php</code>.

source: Example filter to completely change the units in the Measurement option type. Added to <code>functions.php</code>.
ru_ru: Пример фильтра для полного изменения единицы измерения параметра Измерение. Может быть добавлено в <code>functions.php</code>.

source: Numeric Slider
ru_ru: Числовой слайдер

source: The Numeric Slider option type displays a jQuery UI slider. It will return a single numerical value for use in a custom function or loop.
ru_ru: Параметр Числовой Слайдер показывает интерфейс сладера jQuery UI. Возвратит одно числовое значение для использования в пользовательской функции или цикле.

source: Page Select
ru_ru: Страница выбора

source: The Page Select option type displays a list of page IDs. It will return a single page ID for use in a custom function or loop.
ru_ru: Параметр Выбор Страницы показывает список индентификаторов страницы. Выдаст идентификатор одной страницы для использования пользовательской функции или цикла.

source: Page Checkbox
ru_ru: Страница с Флажками

source: The Page Select option type displays a list of page IDs. It allows the user to check multiple page IDs for use in a custom function or loop.
ru_ru: Параметр Выбор Страницы отображает список идентификаторов страниц. Это позволяет пользователю проверить многостраничные идентификаторы для использования в пользовательской функции или цикле.

source: Post Select
ru_ru: Выбрать сообщение

source: The Post Select option type displays a list of post IDs. It will return a single post ID for use in a custom function or loop.
ru_ru: Тип параметра Выбор Записи показывает список идентификаторов записи, один из которых можно использовать в пользовательской функции или цикле.

source: Post Checkbox
ru_ru: Пометить сообщение

source: The Post Select option type displays a list of post IDs. It allows the user to check multiple post IDs for use in a custom function or loop.
ru_ru: Параметр Выбрать Запись отображает список идентификаторов. Это позволяет пользователю проверить нескольких почтовых идентификаторов для использования в пользовательской функции или цикла.

source: Radio
ru_ru: Радио

source: The Radio option type could ask a question. For example, "Do you want to activate the custom navigation?" could require a yes or no answer with a radio option. In this situation you would test if the radio has a value of 'yes' and execute a block of code, or if it's 'no' execute a different block of code.
ru_ru: Параметр типа Радио может задать вопрос. Например, "Вы хотите активировать пользовательскую навигацию?" здесь потребуется ответ да или нет при помощи кнопки радио. В этой ситуации вы сможете протестировать случаи значения "Да"кнопки Радио и выполнить блок кода, или, если «Нет» выполнять другой блок кода.

source: Radio Image
ru_ru: Радио Изображения

source: the Radio Images option type is primarily used for layouts. However, you can filter the image list using <code>ot_radio_images</code>. As well, you can add your own custom images using the choices array.
ru_ru: Параметр типа Радио Изображений в основном используется для макетов. Однако, вы можете отфильтровать список изображений с помощью <code>ot_radio_images</code>. Также, вы можете добавить свои собственные изображения, используя варианты массива.

source: This example executes the <code>ot_radio_images</code> filter on layout images attached to the <code>my_radio_images</code> field. Added to <code>functions.php</code>.
ru_ru: В этом примере выполняется код фильтра <code>ot_radio_images</code> на макет изображения, прикрепленные к полю <code>my_radio_images</code>. Добавлено в код<code>functions.php</code>.

source: Select
ru_ru: Выбрать

source: The Select option type is used to list anything you want that would be chosen from a select list.
ru_ru: Параметр Выборка используется, чтобы перечислить все, что вы хотите и выбрали бы из списка выбора.

source: Sidebar Select
ru_ru: Выбрать панель

source: This option type makes it possible for users to select a WordPress registered sidebar to use on a specific area. By using the two provided filters, <code>ot_recognized_sidebars</code>, and <code>ot_recognized_sidebars_{$field_id}</code> we can be selective about which sidebars are available on a specific content area.
ru_ru: Этот параметр позволяет пользователям выбрать зарегистрированную панели WordPress для использования в конкретной области. Используя данные два фильтра, <code>ot_recognized_sidebars</code>и <code>ot_recognized_sidebars_{$field_id}</code> мы можем быть избирательными - какие боковые панели доступны на конкретной контентной области.

source: For example, if we create a WordPress theme that provides the ability to change the Blog Sidebar and we don't want to have the footer sidebars available on this area, we can unset those sidebars either manually or by using a regular expression if we have a common name like <code>footer-sidebar-$i</code>.
ru_ru: Например, если мы создаем тему WordPress, которая предоставляет возможность изменять Боковую панель Блога, и мы не хотим чтобы был футер в сайдбарах, этой области, мы можем демонтировать эти сайдбары либо вручную, либо с помощью регулярного выражения, если у нас есть общее название, например, <code>footer-sidebar-$i</code>.

source: Slider
ru_ru: Слайдер

source: The Slider option type is technically deprecated. Use the List Item option type instead, as it's infinitely more customizable. Typical use is for creating sliding image content.
ru_ru: Параметр Слайдер является технически устаревшим. Взамен используйте параметр Элемент Списка, так как он более настраиваемый. Типичное применение-для создания скользящего контента с изображениями.

source: Tag Checkbox
ru_ru: Пометить тэг

source: The Tag Checkbox option type displays a list of tag IDs. It allows the user to check multiple tag IDs and will return that value as an array for use in a custom function or loop.
ru_ru: Параметр Тег Флажок отображает список идентификаторов тегов. Это позволяет пользователю проверить несколько идентификаторов тегов и вернется это значение в виде массива для использования в пользовательской функции или цикла.

source: Tag Select
ru_ru: Выбрать метку

source: The Tag Select option type displays a list of tag IDs. It allows the user to select only one tag ID and will return that value for use in a custom function or loop.
ru_ru: Параметр Выборка Тега отображает список идентификаторов тега. Это позволяет пользователю выбрать только один идентификатор тега и вернется это значение для использования в пользовательской функции или цикла.

source: Taxonomy Checkbox
ru_ru: Пометить Таксономию

source: The Taxonomy Checkbox option type displays a list of taxonomy IDs. It allows the user to check multiple taxonomy IDs and will return that value as an array for use in a custom function or loop.
ru_ru: Параметр Таксономия Флажок отображает список идентификаторов таксономии. Это позволяет пользователю проверить несколько идентификаторов таксономии и вернется это значение в виде массива для использования в пользовательской функции или цикла.

source: Taxonomy Select
ru_ru: Выбрать Таксономию

source: The Taxonomy Select option type displays a list of taxonomy IDs. It allows the user to select only one taxonomy ID and will return that value for use in a custom function or loop.
ru_ru: Параметр Выборка Таксономии отображает список идентификаторов таксономии. Это позволяет пользователю выбрать только один идентификатор таксономии и вернется это значение для использования в пользовательской функции или цикла.

source: Text (Input)
ru_ru: Область ввода текста

source: The Text option type would be used to save a string value. For example, a link to feedburner, your Twitter username, or Google Analytics ID are all good candidates. Any optional or required text that is of reasonably short character length.
ru_ru: Параметр Текст используется для сохранения строкового значения. Например, ссылка на feedburner, ваш твиттер-аккаунт или идентификатор Google Analytics. Чем короче длина текста - тем лучше.

source: Textarea
ru_ru: Область текста

source: The Textarea option type is a large string value used for custom code or text in the theme. The new Textarea has a WYSIWYG editor that can be filtered to change the buttons shown. For example, you can filter on <code>wpautop</code>, <code>media_buttons</code>, <code>tinymce</code>, and <code>quicktags</code>.
ru_ru: Параметр Textarea большой значение строки используются для пользовательского кода или текста в теме. В новом Textarea визуальный редактор может изменять фильтром кнопки. Например, можно отфильтровать по <code>wpautop</ кода>, <code>media_buttons</code>, <code>tinymce</code>, и <code>quicktags</code>.

source: Example filters to alter the Textarea option type. Added to <code>functions.php</code>.
ru_ru: Пример фильтров, которые могут изменить параметр типа Текстовая область. Может быть добавлено в <code>functions.php</code>.

source: This example keeps WordPress from executing the <code>wpautop</code> filter on the line breaks. The default is <code>true</code> which means it wraps line breaks with an HTML <code>p</code> tag.
ru_ru: Этот пример убережет от исполнения в WordPress кода <code>wpautop</code> фильтра разрыва строк. По умолчанию используется значение <code>true</code>, который означает, что он обертывает разрывы строк HTML-тегом <code>р</code>.

source: This example keeps WordPress from executing the <code>media_buttons</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the buttons.
ru_ru: Этот пример поможет избежать исполнеия в WordPress фильтра <code>media_buttons</code> в текстовом поле редактора-WYSIWYG. По умолчанию используется значение <code>true</code>, который означает - показать кнопки.

source: This example keeps WordPress from executing the <code>tinymce</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the tinymce.
ru_ru: Этот пример исключит исполнение в WordPress фильтра <code>tinymce</code> текстового поля WYSIWYG-редактора. По умолчанию используется значение <code>true</code>, который означает - показать tinymce.

source: This example alters the <code>quicktags</code> filter on the textarea WYSIWYG. The default is <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code> which means show those quicktags. It also means you can filter in your own custom quicktags.
ru_ru: Этот пример изменяет фильтр <code>quicktags</code> в текстовом поле WYSIWYG-редактора. По умолчанию используется значение <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code>, которое означает посмотреть те quicktags. Это также означает, что вы можете отфильтровать пользовательские quicktags.

source: Textarea Simple
ru_ru: Область текста простая

source: The Textarea Simple option type is a large string value used for custom code or text in the theme. The new Textarea Simple does not have a WYSIWYG editor. But you can still filter on <code>wpautop</code>.
ru_ru: Параметр Простая Текстовая область это большее значение строки используются для пользовательского кода или текста в теме. Новая Простая Текстовая область не имеет WYSIWYG-редактора. Но вы можете все-таки фильтровать по <code>wpautop</code>.

source: This example tells WordPress to execute the <code>wpautop</code> filter on the line breaks. The default is <code>false</code> which means it does not wraps line breaks with an HTML <code>p</code> tag. Added to <code>functions.php</code>.
ru_ru: Этот пример говорит WordPress исполнить фильтр <code>wpautop</code> на разрывах строк. По умолчанию используется значение <code>false</code>, которое означает, что он не обвертывает разрывы строк HTML-тегом <code>р</code>. Добавлено в <code>functions.php</code>.

source: Textblock
ru_ru: Блок текста

source: The Textblock option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page but has no title above the text block. You can then use the Textblock to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
ru_ru: Параметр Текстовый блок используется только на странице Параметров Темы. Это позволит вам создавать и показывать HTML на странице Параметров Темы но без заголовка над текстовым блоком. Вы можете использовать Текстовый блок чтобы добавить более подробный набор инструкций о том, как данные параметры используются в вашей теме. НИКОГДА не используйте это в файлах шаблонов темы.

source: Textblock Titled
ru_ru: Заголовок для блока текста

source: The Textblock Titled option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page and has a title above the text block. You can then use the Textblock Titled to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
ru_ru: Параметр Озаглавленный Текстовый блок используется только на странице Параметров Темы. Это позволит вам создавать и показывать HTML на странице Параметров Темы и имеет заголовок над текстовым блоком. Вы можете использовать Озаглавленный Текстовый блок чтобы добавить более подробный набор инструкций о том, как эти параметры используются в вашей теме. НИКОГДА не используйте это в файлах шаблонов темы.

source: Typography
ru_ru: Типографика

source: The Typography option type is for adding typographic styles to your theme either dynamically via the CSS option type below or manually with <code>ot_get_option()</code>. Typography has filters that allow you to change the defaults. For example, you can filter on <code>ot_recognized_font_styles</code>, <code>ot_recognized_font_weights</code>, <code>ot_recognized_font_variants</code>, and <code>ot_recognized_font_families</code>. These filters allow you to fine tune the select lists for your specific CSS needs. The most important one though is <code>ot_recognized_font_families</code> as you can add your Google Fonts to create custom font stacks.
ru_ru: Параметр Типография предназначен для добавления типографских стилей к вашей теме, динамически через нижеуказанный параметр CSS, или вручную при помощи <code>ot_get_option()</code>. Типография имеет фильтры, которые позволяют изменить значения на исходные. Например, можно отфильтровать по <code>ot_recognized_font_styles</code>, <code>ot_recognized_font_weights</code>, <code>ot_recognized_font_variants</code>, and <code>ot_recognized_font_families</code>. Эти фильтры позволяют точно настроить ваши CSS из предложенного списка. Наиболее важным из них это <code>ot_recognized_font_families</code>, но также вы можете добавить Google шрифты.

source: This example would filter <code>ot_recognized_font_families</code> to build your own font stack. Added to <code>functions.php</code>.
ru_ru: Этот пример фильтра <code>ot_recognized_font_families</code>, чтобы построить свой собственный стека шрифта. Добавлено в <code>functions.php</code>.

source: Upload
ru_ru: Загрузить

source: The Upload option type is used to upload any WordPress supported media. After uploading, users are required to press the "Send to OptionTree" button in order to populate the input with the URI of that media. There is one caveat of this feature. If you import the theme options and have uploaded media on one site the old URI will not reflect the URI of your new site. You'll have to re-upload or FTP any media to your new server and change the URIs if necessary.
ru_ru: Параметр Загрузка нужен чтобы загружать поддерживаемые WordPress медиафайлы. После загрузки, пользователи должны нажать на кнопку "Отправить в Панель опций" чтобы заполнить область ввода с URI, что СМИ. Есть один нюанс этой функции. Если вы импортировать настройки темы и загрузили СМИ на одной площадке старого URI не будет отражать URI вашего нового сайта. Вам придется повторно загружать или FTP любых СМИ, чтобы ваш новый сервер и изменить URI, если это необходимо.

source: This function returns a value from the "option_tree" array of saved values or the default value supplied. The returned value would be mixed. Meaning it could be a string, integer, boolean, or array.
ru_ru: Эта функция возвращает значение из "option_tree" массива сохраненных значений или значения по умолчанию в комплекте. Возвращенное значение может быть любым: строка, целое число, логическое значение или массив.

source: Usage
ru_ru: Использование

source: Parameters
ru_ru: Параметры

source: string
ru_ru: строка

source: required
ru_ru: требуется

source: Enter the options unique identifier.
ru_ru: Введите параметры, уникальный идентификатор.

source: Default:
ru_ru: По умолчанию:

source: None
ru_ru: Ни один

source: optional
ru_ru: необязательный

source: Enter a default return value. This is just incase the request returns null.
ru_ru: Введите значение возврата по умолчанию. Это нужно в случае, если запрос возвращает нулевое значение.

source: Default
ru_ru: По умолчанию

source: This function has been deprecated. That means it has been replaced by a new function or is no longer supported, and may be removed from future versions. All code that uses this function should be converted to use its replacement.
ru_ru: Эта функция устарела. Это означает, что она была заменена новой функции или больше не поддерживается, и могут быть удалены из будущих версий. Весь код, который использует эта функция должна быть преобразованы для использования его замены.

source: Use
ru_ru: Использовать

source: instead
ru_ru: вместо

source: This function returns, or echos if asked, a value from the "option_tree" array of saved values.
ru_ru: По запросу, эта функция возвращает или отображает значение из "option_tree" массива сохраненных значений.

source: Enter a unique Option Key to get a returned value or array.
ru_ru: Введите уникальный параметр ключа, чтобы получить обратное значение или массив.

source: array
ru_ru: массив

source: Used to cut down on database queries in template files.
ru_ru: Используется, чтобы сократить запросы к базе данных файлов шаблона.

source: boolean
ru_ru: логическое значение

source: Echo the output.
ru_ru: Показать результаты

source: Used to indicate the $item_id is an array of values.
ru_ru: Используется для указания $item_id является массив значений.

source: integer
ru_ru: целое число

source: Numeric offset key for the $item_id array, -1 will return all values (an array starts at 0).
ru_ru: Ключ Числового смещения для $item_id массива, значение -1 вернет все значения (массив начинается с 0).
