Repository: Applesmart/hueman-languages
Catalog: fullver._*.po
Languages: ru_ru

source: To add a new layout enter a unique lower case alphanumeric string (dashes allowed) in the text field and click "Save Layouts".
ru_ru: Чтобы добавить новый макет, введите уникальное имя в текстовое поле (допускается в нижнем регистре буквенно-цифровые символы, а т.ч. тире) и нажмите кнопку "Сохранить Макеты".

source: As well, you can activate, remove, and drag & drop the order; all situations require you to click "Save Layouts" for the changes to be applied.
ru_ru: Кроме того, вы можете по порядку активировать, удалить, и зацепить&перетащить; во всех случаях требуется кликнуть "Сохранить Макеты", чтобы изменения были сохранены.

source: When you create a new layout it will become active and any changes made to the Theme Options will be applied to it. If you switch back to a different layout immediately after creating a new layout that new layout will have a snapshot of the current Theme Options data attached to it.
ru_ru: Новый макет, при создании становится активным и любые изменения, сделанные в настройках Темы будут применяться к нему. Если вы переключитесь на другой макет сразу после создания нового макета, то эта новая схема будет иметь снимок текущей Темы в Параметрах данных.

source: Visit <code>OptionTree->Documentation->Layouts Overview</code> to see a more in-depth description of what layouts are and how to use them.
ru_ru: Перейдите <code>Опция древа->Документация->Обзор Макетов</code>, чтобы увидеть более подробное описание того, какие макеты есть и как их использовать.

source: Save Layouts
ru_ru: Сохранить Макеты

source: Reset Options
ru_ru: Сбросить Настройки
