Repository: Applesmart/hueman-languages
Catalog: fullver._*.po
Languages: ru_ru

source: The page you are trying to reach does not exist, or has been moved. Please use the menus or the search box to find what you are looking for.
ru_ru: Страница, на которую вы пытаетесь перейти, не существует или была перемещена. Пожалуйста, используйте меню или окно поиска, чтобы найти то, что вы ищете.

source: No Responses
ru_ru: Ответов Нет

source: 1 Response
ru_ru: 1 Ответ

source: % Responses
ru_ru: % Ответов

source: Comments
ru_ru: Комментарии

source: Trackbacks &amp; Pingbacks
ru_ru: Обратные ссылки и запросы

source: All Rights Reserved.
ru_ru: Все права защищены.

source: Powered by
ru_ru: Работает на

source: Theme by
ru_ru: Дизайн от

source: For the term
ru_ru: На срок

source: Please try another search:
ru_ru: Пожалуйста, попробуйте еще один поиск:

source: To search type and hit enter
ru_ru: Для поиска введите запрос и нажмите ввод

source: Expand Sidebar
ru_ru: Развернуть панель

source: More
ru_ru: Больше

source: Follow:
ru_ru: Подписаться:

source: by
ru_ru: от

source: Pages:
ru_ru: Страницы:

source: Tags:
ru_ru: Метки:

source: Install Required Plugins
ru_ru: Установите Требуемые Плагины

source: Install Plugins
ru_ru: Установите Плагины

source: Installing Plugin: %s
ru_ru: Устанавливаются Плагины: %s

source: Something went wrong.
ru_ru: Что-то пошло не так.

source: Return to Required Plugins Installer
ru_ru: Вернуться к Установщику Требуемых Плагинов

source: Return to the dashboard
ru_ru: Вернуться к экрану консоли

source: Plugin activated successfully.
ru_ru: Плагины успешно активированы.

source: The following plugin was activated successfully:
ru_ru: Следующий плагин был успешно активирован:

source: All plugins installed and activated successfully. %1$s
ru_ru: Все плагины установлены и успешно активированы. %1$s

source: Dismiss this notice
ru_ru: Игнорировать это уведомление

source: External Link
ru_ru: Внешняя ссылка

source: Private Repository
ru_ru: Личное Хранилище

source: Pre-Packaged
ru_ru: Предварительно упаковано

source: WordPress Repository
ru_ru: WordPress Хранилище

source: Required
ru_ru: Требуемый

source: Recommended
ru_ru: Рекомендуемый

source: Not Installed
ru_ru: Не установлено

source: Installed But Not Activated
ru_ru: Установлено без активации

source: No plugins to install or activate. <a href="%1$s" title="Return to the Dashboard">Return to the Dashboard</a>
ru_ru: Плагины для установки или активации не обнаружены. <a href="%1$s" title="Вернуться к консоли">Вернуться к консоли</a>

source: Plugin
ru_ru: Плагин

source: Source
ru_ru: Источник

source: Type
ru_ru: Тип

source: Status
ru_ru: Статус

source: Install
ru_ru: Установить

source: Activate
ru_ru: Активировать

source: Install package not available.
ru_ru: Файлы установки не доступны

source: Downloading install package from <span class="code">%s</span>&#8230;
ru_ru: Закачка установочного пакета из <span class="code">%s</span>&#8230;

source: Unpacking the package&#8230;
ru_ru: Распаковываются файлы установки&#8230;

source: Installing the plugin&#8230;
ru_ru: Устанавливается плагин&#8230;

source: Plugin install failed.
ru_ru: Не удалось установить плагин.

source: Plugin installed successfully.
ru_ru: Плагин успешно установлен.

source: Plugin activation failed.
ru_ru: Плагин не удалось активировать.

source: The installation and activation process is starting. This process may take a while on some hosts, so please be patient.
ru_ru: Начинается процесс установки и активации. Этот процесс может занять некоторое время на некоторых хостах, поэтому, пожалуйста, будьте терпеливы.

source: %1$s installed and activated successfully.
ru_ru: %1$s успешно установлено и активировано.

source: Show Details
ru_ru: Показать детали

source: Hide Details
ru_ru: Скрыть Подробности

source: All installations and activations have been completed.
ru_ru: Все установки и активации завершены.

source: Installing and Activating Plugin %1$s (%2$d/%3$d)
ru_ru: Плагин устанавливается и активируется %1$s (%2$d/%3$d)

source: The installation process is starting. This process may take a while on some hosts, so please be patient.
ru_ru: Начинается процесс установки и активации. Этот процесс может занять некоторое время на некоторых хостах, поэтому, пожалуйста, будьте терпеливы.

source: An error occurred while installing %1$s: <strong>%2$s</strong>.
ru_ru: Произошла ошибка при установке %1$s: <strong>%2$s</strong>.

source: The installation of %1$s failed.
ru_ru: Установка %1$s не удалась.

source: %1$s installed successfully.
ru_ru: %1$s успешно установлено.

source: All installations have been completed.
ru_ru: Все установки завершены.

source: Installing Plugin %1$s (%2$d/%3$d)
ru_ru: Устанавливается плагин %1$s (%2$d/%3$d)

source: Return to the Dashboard
ru_ru: Вернуться к консоли

source: Recent Posts
ru_ru: Последние Записи

source: Popular Posts
ru_ru: Популярные Записи

source: Recent Comments
ru_ru: Последние комментарии

source: Tags
ru_ru: Метки

source: says:
ru_ru: говорит:

source: Search results
ru_ru: Результаты поиска

source: Error 404.
ru_ru: Ошибка 404.

source: Page not found!
ru_ru: Страница не найдена!

source: Author:
ru_ru: Автор:

source: Category:
ru_ru: Категория:

source: Tagged:
ru_ru: Отмечено:

source: Daily Archive:
ru_ru: Архив за день:

source: Monthly Archive:
ru_ru: Архив за месяц:

source: Yearly Archive:
ru_ru: Архив за год:

source: Next story
ru_ru: Следующее событие

source: Previous story
ru_ru: Предыдущее событие

source: You may also like...
ru_ru: Также вы можете...

source: Share
ru_ru: Поделитесь

source: Theme Options
ru_ru: Параметры Темы

source: Theme Options updated.
ru_ru: Параметры Темы обновлены.

source: Theme Options reset.
ru_ru: Параметры Темы сброшены.

source: Save Changes
ru_ru: Сохранить изменения

source: OptionTree
ru_ru: Плагин OptionTree

source: Settings
ru_ru: Настройки

source: Save Settings
ru_ru: Сохранить настройки

source: Theme Options UI
ru_ru: Параметры пользовательского интерфейса Темы

source: Import
ru_ru: Импортировать

source: Export
ru_ru: Экспорт

source: Layouts
ru_ru: Макеты

source: Theme Options UI Builder
ru_ru: Параметры Конструктора пользовательского интерфейса Темы

source: Settings XML
ru_ru: Настройки XML

source: Settings PHP File
ru_ru: Настройки PHP-файла

source: Layout Management
ru_ru: Управление Макетом

source: Documentation
ru_ru: Документация

source: Creating Options
ru_ru: Создание параметров

source: Option Types
ru_ru: Типы Параметра

source: Function References
ru_ru: Справочник Функций

source: Theme Mode
ru_ru: Вид Темы

source: Meta Boxes
ru_ru: Мета-Блоки

source: Code Examples
ru_ru: Примеры кода

source: Layouts Overview
ru_ru: Обзор макетов

source: Overview of available Theme Option fields.
ru_ru: Обзор доступных полей параметров Темы.

source: Option types in alphabetical order & hooks to filter them.
ru_ru: Типы Параметра в алфавитном порядке и способы их фильтрации.

source: Function Reference:ot_get_option()
ru_ru: Справка Функции:ot_get_option()

source: Function Reference:get_option_tree()
ru_ru: Справка Функции:get_option_tree()

source: Code examples for front-end development.
ru_ru: Примеры кода для фронтэнд разработки.

source: What's a layout anyhow?
ru_ru: Какой-то другой макет?

source: The Colorpicker only allows valid hexadecimal values.
ru_ru: Цветовая Пипетка работает только с шестнадцатеричными значениями.

source: Send to OptionTree
ru_ru: Отправить в OptionTree

source: Remove Media
ru_ru: Удалить медиафайл

source: Are you sure you want to reset back to the defaults?
ru_ru: Вы уверены, что хотите восстановить значения по умолчанию?

source: You can't remove this! But you can edit the values.
ru_ru: Вы не можете удалить это! Но вы можете редактировать значения.

source: Are you sure you want to remove this?
ru_ru: Вы уверены, что хотите это удалить?

source: Are you sure you want to activate this layout?
ru_ru: Вы уверены, что хотите активировать этот макет?

source: Sorry, you can't have settings three levels deep.
ru_ru: Извините, вы не можете иметь параметры трех уровней вложенности.

source: General
ru_ru: Главный

source: Sample Text Field Label
ru_ru: Образец Текстового поля

source: Description for the sample text field.
ru_ru: Описание образца текстового поля.

source: Settings updated.
ru_ru: Настройки обновлены.

source: Settings could not be saved.
ru_ru: Настройки не могут быть сохранены.

source: Settings Imported.
ru_ru: Настройки импортированы.

source: Settings could not be imported.
ru_ru: Настройки не могут быть импортированы.

source: Data Imported.
ru_ru: Данные импортированы.

source: Data could not be imported.
ru_ru: Данные не могли быть импортированы.

source: Layouts Imported.
ru_ru: Макеты импортированы.

source: Layouts could not be imported.
ru_ru: Макеты не могут быть импортированы.

source: Layouts Updated.
ru_ru: Макеты обновлены.

source: Layouts could not be updated.
ru_ru: Макеты не могут быть обновлены.

source: Layouts have been deleted.
ru_ru: Макеты были удалены.

source: Layout activated.
ru_ru: Макет активирован.

source: Left Sidebar
ru_ru: Левая Боковая панель

source: Right Sidebar
ru_ru: Правая панель

source: Full Width (no sidebar)
ru_ru: Полная Ширина (без боковой панели)

source: Dual Sidebar
ru_ru: Двойная Боковая панель

source: Left Dual Sidebar
ru_ru: Левая часть Двойной Боковой панели

source: Right Dual Sidebar
ru_ru: Правая двойная панель

source: Image
ru_ru: Изображение

source: Link
ru_ru: Ссылка

source: Description
ru_ru: Описание

source: edit
ru_ru: редактировать

source: Edit
ru_ru: Редактировать

source: Delete
ru_ru: Удалить

source: <strong>Section Title</strong>: Displayed as a menu item on the Theme Options page.
ru_ru: <strong>Заголовок Раздела</strong>: Отображается как пункт меню на странице параметров Темы.

source: <strong>Section ID</strong>: A unique lower case alphanumeric string, underscores allowed.
ru_ru: <strong>Идентификатор Раздела</strong>: Допускается в нижнем регистре буквенно-цифровая Уникальная строка, в т.ч. нижнее подчеркивание

source: <strong>Label</strong>: Displayed as the label of a form element on the Theme Options page.
ru_ru: <strong>Метка</strong>: Отображается как метка элемента формы на странице параметров Темы.

source: <strong>ID</strong>: A unique lower case alphanumeric string, underscores allowed.
ru_ru: <strong>Идентификатор</strong>: Допускается в нижнем регистре буквенно-цифровая Уникальная строка, в т.ч. нижнее подчеркивание

source: <strong>Type</strong>: Choose one of the available option types from the dropdown.
ru_ru: <strong>Тип</strong>: Выберите один из доступных типов параметр из выпадающего списка.

source: <strong>Description</strong>: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
ru_ru: <strong>Описание</strong>: Введите детальное описание для пользователей, чтобы прочесть на странице параметров Темы, HTML допускается. Это также необходимо сделать где вы вводите контент для параметров Текстовый блок и Озаглавленый Текстовый блок.

source: <strong>Choices</strong>: This will only affect the following option types: Checkbox, Radio, Select & Select Image.
ru_ru: <strong>Выбор</strong>: Это повлияет только на следующие типы параметров: Чекбокс, Радио, Селект и Селект Изображения. (Checkbox, Radio, Select & Select Image.)

source: Add Choice
ru_ru: Добавить Выбор

source: <strong>Settings</strong>: This will only affect the List Item option type.
ru_ru: <strong>Настройки</strong>: Это повлияет только на опцию типа: Элемент списка.

source: Add Setting
ru_ru: Добавить настройку

source: <strong>Standard</strong>: Setting the standard value for your option only works for some option types. Read the <code>OptionTree->Documentation</code> for more information on which ones.
ru_ru: <strong>Стандарт</strong>: Настройка стандартного значения для вашего параметра работает только для некоторых типов параметров. Ознакомьтесь <code>Плагин OptionTree->Документация</code> для получения дополнительной информации.

source: <strong>Rows</strong>: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
ru_ru: <strong>Строки</strong>: Введите числовое значение количества строк в вашей текстовой области. Это касается только следующих типов опций: CSS, текстовая область, и простая текстовая область.

source: <strong>Post Type</strong>: Add a comma separated list of post type like 'post,page'. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select.
ru_ru: <strong>Тип записи</strong>: Добавьте через запятую список пост типа 'post,page'. Это повлияет только на следующие типы параметров: Флажок Пользовательского типа Поста и Селект Пользовательского Типа Поста.

source: <strong>Taxonomy</strong>: Add a comma separated list of any registered taxonomy like 'category,post_tag'. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
ru_ru: <strong>Таксономия</strong>: Добавить через запятые все зарегистрированные таксономии, такие как 'category,post_tag'. Это повлияет только на следующие типы параметров: Флажок Таксономии и Селект Таксономии.

source: <strong>Min, Max, & Step</strong>: Add a comma separated list of options in the following format <code>0,100,1</code> (slide from <code>0-100</code> in intervals of <code>1</code>). The three values represent the minimum, maximum, and step options and will only affect the Numeric Slider option type.
ru_ru: <strong>Min, Max, & Step</strong>: Добавить через запятую список параметров в следующем формате <code>0,100,1</code> (слайд от <code>0-100</code> с интервалом в <code>1</code>). Три значения представляют собой минимальное, максимальное и шагую функции и влияет только на тип параметра Числовой Слайдер.

source: <strong>CSS Class</strong>: Add and optional class to this option type.
ru_ru: <strong>Класс CSS</strong>: Добавление необязательно класса в этот тип параметра.

source: Label
ru_ru: Пометка

source: Value
ru_ru: Значение

source: Image Source (Radio Image only)
ru_ru: Источник изображения (только для изображений с кнопкой Радио)

source: <strong>Title</strong>: Displayed as a contextual help menu item on the Theme Options page.
ru_ru: <strong>Заголовок</strong>: Отображен в меню контекстной справки на странице Параметры Темы.

source: <strong>Content</strong>: Enter the HTML content about this contextual help item displayed on the Theme Option page for end users to read.
ru_ru: <strong>Содержание</strong>: Введите содержимое в формате HTML об этом элементе контекстной справки, отображаемой на странице Параметры Темы для конечных пользователей.

source: Layout
ru_ru: Макет

source: Title
ru_ru: Заголовок

source: New Layout
ru_ru: Новый Макет

source: The Label field should be a short but descriptive block of text 100 characters or less with no HTML.
ru_ru: Поле Метка должна быть короткая, с описательным блоком текста в 100 и менее знаками, без HTML.

source: ID
ru_ru: Идентификатор

source: The ID field is a unique alphanumeric key used to differentiate each theme option (underscores are acceptable). Also, the plugin will change all text you write in this field to lowercase and replace spaces and special characters with an underscore automatically.
ru_ru: Поле Индентификатора (ID) - это уникальный буквенно-цифровой ключ используемый для определения каждого параметра темы. Кроме того, весь вносимый текст будет автоматически изменяться плагином, заменяя в символы с нижним регистром, заменяя пробелы и специальные символы подчеркиванием.

source: You are required to choose one of the supported option types when creating a new option. Here is a list of the available option types. For more information about each type click the <code>Option Types</code> tab to the left.
ru_ru: Вы должны выбрать один из поддерживаемых типов параметров при создании нового параметра. Вот список доступных типов параметров. Для получения дополнительной информации о каждом типе кликните вкладку слева <code>Типы параметров</code>.

source: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
ru_ru: Введите детальное описание для чтения пользователями на странице Параметры Темы, допускается формат HTML. Также необходимо ввести контент для обоих параметров Текстовый блок и Озаглавленный Текстовый блок.

source: Choices
ru_ru: Выбор

source: Click the "Add Choice" button to add an item to the choices array. This will only affect the following option types: Checkbox, Radio, Select & Select Image.
ru_ru: Чтобы добавать элемент в массив вариантов, нажмите кнопку "Добавить Выбор". Это повлияет только на следующие типы параметров: Чекбокс, Радио, Селект и Селект Изображения. (Checkbox, Radio, Select & Select Image.)

source: Click the "Add Setting" button found inside a newly created setting to add an item to the settings array. This will only affect the List Item type.
ru_ru: Для добавления элемента в массив настроек, внутри вновь созданного параметра, нажмите кнопку "Добавить параметр". Это затронет только тип элемента Список.

source: Standard
ru_ru: Стандарт

source: Setting the standard value for your option only works for some option types. Those types are one that have a single string value saved to them and not an array of values.
ru_ru: Установка стандартного значения для вашего параметра работает только с некоторыми типами параметров. Эти типы имеют одно сохраненное строковое значение, а не массив значений.

source: Rows
ru_ru: Ряды

source: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
ru_ru: Введите числовое значение для количества строк в текстовой области. Это касается только для следующих типов опции: CSS, Textarea, & Textarea Simple.

source: Post Type
ru_ru: Тип сообщения

source: Add a comma separated list of post type like <code>post,page</code>. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select. Below are the default post types available with WordPress and that are also compatible with OptionTree. You can also add your own custom <code>post_type</code>. At this time <code>any</code> does not seem to return results properly and is something I plan on looking into.
ru_ru: Добавьте через запятую список пост типа <code>пост,страница</code>. Это повлияет только на следующие типы параметров: Флажок Пользовательского типа Поста и Селект Пользовательского Типа Поста. Ниже приведено тип сообщения по умолчанию, который доступн в WordPress, а также совместим с Панелью опций. Вы можете также добавить ваши собственные пользовательские <code>post_type</code>. К тому же <code>any</code> кажется не возвращает результаты правильно и т.д., что я и планирую изучить.

source: Taxonomy
ru_ru: Таксономия

source: Add a comma separated list of any registered taxonomy like <code>category,post_tag</code>. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
ru_ru: Добавьте через запятую любую зарегистрированную таксономию типа <code>category,post_tag</code>. Это касается только следующих типов опций: Флажок Таксономии и Селект Таксономии.

source: Min, Max, & Step
ru_ru: Минимум, Максимум, и Шаг

source: Add a comma separated list of options in the following format <code>0,100,1</code> (slide from <code>0-100</code> in intervals of <code>1</code>). The three values represent the minimum, maximum, and step options and will only affect the Numeric Slider option type.
ru_ru: Добавить через запятую список параметров в следующем формате <code>0,100,1</code> (слайд от <code>0-100</code> с интервалом в <code>1</code>). Три значения представляют собой минимальное, максимальное и шагую параметры и влияет только на тип параметра Числовой Слайдер.

source: CSS Class
ru_ru: Класс CSS

source: Add and optional class to any option type.
ru_ru: Добавить класс к любому типу параметра, необязательно.

source: Background
ru_ru: Фон

source: The Background option type is for adding background styles to your theme either dynamically via the CSS option type below or manually with <code>ot_get_option()</code>. Background has filters that allow you to change the defaults. For example, you can filter on <code>ot_recognized_background_repeat</code>, <code>ot_recognized_background_attachment</code>, and <code>ot_recognized_background_position</code>. These filters allow you to fine tune the select lists for your specific CSS needs.
ru_ru: Параметр типа Фон преназначен для добавления стилей фона к вашей теме, либо динамически через параметр типа CSS ниже или вручную через <code>ot_get_option()</code>. Фон имеет фильтры, которые позволяют изменить значения по умолчанию. Например, можно отфильтровать по <code>ot_recognized_background_repeat</code>, <code>ot_recognized_background_attachment</code>, and <code>ot_recognized_background_position</code>. Эти фильтры позволяют точно настроить списки выбора для ваших конкретных CSS потребностей.

source: Category Select
ru_ru: Выбрать Категорию

source: The Category Select option type displays a list of category IDs. It allows the user to select only one category ID and will return that value for use in a custom function or loop.
ru_ru: Параметр Выбрать Категорию отображает список идентификаторов категорий. Это позволяет пользователю выбрать только один идентификатор категории и вернуть это значение для использования в пользовательской функции или цикла.

source: Category Checkbox
ru_ru: Отметить Категорию

source: The Category Checkbox option type displays a list of category IDs. It allows the user to check multiple category IDs and will return that value as an array for use in a custom function or loop.
ru_ru: Параметр Категория Флажок отображает список идентификаторов категорий. Это позволяет пользователю проверить несколько идентификаторов категорий и вернуть то значение в виде массива для использования в пользовательской функции или цикла.

source: Checkbox
ru_ru: Пометить

source: The Checkbox option type is fairly self explanatory. Typically used to ask questions. For example, "Do you want to activate asynchronous Google analytics?" would be a single checkbox with a value of yes. You could have more complex usages but the idea is that you can easily grab the value of the checkbox and use it in you theme. In this situation you would test if the checkbox has a value and execute a block of code if it does and do nothing if it doesn't.
ru_ru: Параметр типа Флажок опция говорит само за себя. Обычно используется, чтобы задать вопросы. Например, у вопроса "Вы хотите активировать асинхронность Гугл Аналитикс?" будет один флажок со значением да. Вы могли бы усложнить использование, но идея состоит в том, что вы можете легко захватить значение флажка и использовать его в вашей теме. В этой ситуации вы могли проверить, имеет ли значение флажок и выполнить блок соотвествующего кода.

source: Colorpicker
ru_ru: Пипетка цвета

source: The Colorpicker option type saves a hexadecimal color code for use in CSS. Use it to modify the color of something in your theme.
ru_ru: Параметр Пипетки цвета хранится в шестнадцатеричном цветовом коде для использования в CSS. С его помощью можно изменять цвет элементов вашей темы.
