Repository: Applesmart/hueman-languages
Catalog: fullver._*.po
Languages: ru_ru

source: If you're using the plugin version of OptionTree it is highly recommended to include a <code>function_exists</code> check in your code, as described in the examples below. If you've integrated OptionTree directly into your themes root directory, you will <strong>not</strong> need to wrap your code with <code>function_exists</code>, as you're guaranteed to have the <code>ot_get_option()</code> function available.
ru_ru: Если вы используете плагин версии Панель опций настоятельно рекомендуется включить <code>function_exists</code> чтобы проверить ваш код, как описано в примерах ниже. Если вы интегрировали Панель опций непосредственно в корневую директорию темы, то вам <strong>не</strong> нужно оборачивать ваш код функцией <code>function_exists</code>, так гарантированно будет доступна функция <code>ot_get_option()</code>.

source: String Examples
ru_ru: Примеры строки

source: Returns the value of <code>test_input</code>.
ru_ru: Возвращает значение <code>test_input</code>.

source: Returns the value of <code>test_input</code>, but also has a default value if it returns empty.
ru_ru: Возвращает значение <code>test_input</code>, но также имеет значение по умолчанию, если она возвращает ноль.

source: Array Examples
ru_ru: Примеры массива

source: Assigns the value of <code>navigation_ids</code> to the variable <code>$ids</code>. It then echos an unordered list of links (navigation) using <code>wp_list_pages()</code>.
ru_ru: Присваивает значение <code>navigation_ids</code> в переменную <code>$ids</code>. Затем выводит неупорядоченный список ссылок (навигация), используя <code>wp_list_pages()</code>.

source: The next two examples demonstrate how to use the <strong>Measurement</strong> option type. The Measurement option type is an array with two key/value pairs. The first is the value of measurement and the second is the unit of measurement.
ru_ru: Следующие два примера показывают, как использовать параметр <strong>Измерение</strong>. Параметр Измерение является массивом с двумя парами ключ/значение. Первый-это значение измерения и второй-это единица измерения.

source: This example displays a very basic slider loop.
ru_ru: Это пример самой простой петли слайдера.

source: It's Super Simple
ru_ru: Это Супер Просто

source: Layouts make your theme awesome! With theme options data that you can save/import/export you can package themes with different color variations, or make it easy to do A/B testing on text and so much more. Basically, you save a snapshot of your data as a layout.
ru_ru: Макеты делают ваша тему удивительными! При помощи параметров темы можно сохранить/импортировать/экспортировать различные цветовые вариации, или сделать его легко провести A/B тестирование на текст и многое другое. В принципе, вы сохраняете снимок ваших данных в качестве макета.

source: Once you have created all your different layouts, or theme variations, you can save them to a separate text file for repackaging with your theme. Alternatively, you could just make different variations for yourself and change your theme with the click of a button, all without deleting your previous options data.
ru_ru: Однажды создав все ваши различные макеты, или вариации темы, вы можете сохранить их в отдельный текстовый файл при переустановке вашей темы. Кроме того, можно просто сделать различные варианты для себя и изменить вашу тему с одним нажатием кнопки, все без удаления предыдущих параметров данных.

source: Adding a layout is ridiculously easy, follow these steps and you'll be on your way to having a WordPress super theme.
ru_ru: Добавление макета очень просто, следуйте этим действиям и у вас получится супер-тема.)

source: For Developers
ru_ru: Для разработчиков

source: Creating a Layout
ru_ru: Создание макета

source: Go to the <code>OptionTre->Settings->Layouts</code> tab.
ru_ru: Перейдите на вкладку <code>OptionTre->Настройки->Макеты</code>.

source: Enter a name for your layout in the text field and hit "Save Layouts", you've created your first layout.
ru_ru: Введите имя для вашего макета в текстовое поле и нажмите "Сохранить Макеты", вы создали свой первый макет.

source: Adding a new layout is as easy as repeating the steps above.
ru_ru: Добавление нового макета также просто, как повторение предыдущих действий.

source: Activating a Layout
ru_ru: Активация макета

source: Click on the activate layout button in the actions list.
ru_ru: Кликните на кнопку активации макета в списке действий.

source: Deleting a Layout
ru_ru: Удаление макета

source: Click on the delete layout button in the actions list.
ru_ru: Кликните на кнопку удаления макета в списке действий.

source: Edit Layout Data
ru_ru: Редактировать данные макета

source: Go to the <code>Appearance->Theme Options</code> page.
ru_ru: Перейдите на страницу <code>Вид->Параметры Темы</code> page.

source: Modify and save your theme options and the layout will be updated automatically.
ru_ru: Измените и сохраните параметры Темы и макет будет обновляться автоматически.

source: Saving theme options data will update the currently active layout, so before you start saving make sure you want to modify the current layout.
ru_ru: Сохранение файлов данных настроек темы будет обновлять в данный момент активный макет, поэтому, прежде чем начать сохранение, убедитесь, что вы хотите изменить текущую структуру.

source: If you want to edit a new layout, first create it then save your theme options.
ru_ru: Если вы хотите редактировать новый макет, сначала создайте его сохраните параметры темы.

source: End-Users Mode
ru_ru: Режим конечного пользователя

source: Enter a name for your layout in the text field and hit "New Layout", you've created your first layout.
ru_ru: Введите название вашего макета в текстовом поле и нажмите "Новый макет", так вы создадите ваш первый макет.

source: Choose a layout from the select list and click the "Activate Layout" button.
ru_ru: Выберите макет из предложенного списка и нажмите кнопку "Активировать макет".

source: End-Users mode does not allow deleting layouts.
ru_ru: Режим Конечные Пользователи не позволяет удаление макетов.

source: Go to the <code>Appearance->Theme Options</code> tab.
ru_ru: Перейдите к вкладке <code>Внешний Вид->Настройки Темы</code>.

source: How-to-guide
ru_ru: Практическое руководство

source: There are a few simple steps you need to take in order to use OptionTree's built in Meta Box API. In the code below I'll show you a basic demo of how to create your very own custom meta box using any number of the option types you have at your disposal. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-meta-boxes.php</code> you can reference.
ru_ru: Несколько простых шагов, чтобы пользоваться Meta Box API, который встроен в плагин OptionTree.

source: It's important to note that Meta Boxes do not support WYSIWYG editors at this time and if you set one of your options to Textarea it will automatically revert to a Textarea Simple until a valid solution is found. WordPress released this statement regarding the wp_editor() function:
ru_ru: Важно отметить, что Мета-боксы не поддерживает WYSIWYG-редакторы и если вы установили одну из ваших настроек в текстовую область он автоматически вернется в Образец текстовой области до тех пор, пока не найдется верное решение. WordPress выпустила данное заявление в отношении функции wp_editor():

source: Once instantiated, the WYSIWYG editor cannot be moved around in the DOM. What this means in practical terms, is that you cannot put it in meta-boxes that can be dragged and placed elsewhere on the page.
ru_ru: Однажды созданный WYSIWYG редактор не может быть перемещен в DOM.Что это означает в практическом плане, что вы не можете поместить его в мета-боксы, которые можно перетаскивать и размещать в каком-то другом месте странице.

source: Create and include your custom meta boxes file.
ru_ru: Создать и включить пользовательский файл мета-блоков.

source: Create a file and name it anything you want, maybe <code>meta-boxes.php</code>.
ru_ru: Создайте файл и назовите его например так <code>meta-boxes.php</code>.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>meta-boxes.php</code> into which will help keep you file structure nice and tidy.
ru_ru: Кроме того, вы, вероятно, захотите создать каталог с именем <code>includes</code> чтобы разместить в файле <code>meta-boxes.php</code>, в который поможет сохранить вам файловую структуру аккуратно и понятно.

source: Add the following code to your <code>functions.php</code>.
ru_ru: Добавьте следующий код в <code>functions.php</code>.

source: Add a variation of the following code to your <code>meta-boxes.php</code>. You'll obviously need to fill it in with all your custom array values. It's important to note here that we use the <code>admin_init</code> filter because if you were to call the <code>ot_register_meta_box</code> function before OptionTree was loaded the sky would fall on your head.
ru_ru: Добавить вариацию следующего кода в файл <code>мета-boxes.php</code>. Вы понадобится заполнить ее всеми вашими пользовательскими значениями массива. Важно отметить, что мы используем фильтр <code>admin_init</code> , потому что, вы должны вызвать функцию <code>ot_register_meta_box</code> до того как OptionTree будет загружен и небо упадет на вашу голову.

source: There are a few simple steps you need to take in order to use OptionTree as a theme included module. In the code below I'll show you a basic demo of how to include the entire plugin as a module, which will allow you to have the most up-to-date version of OptionTree without ever needing to hack the core of the plugin. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-theme-options.php</code> you can reference.
ru_ru: Есть несколько простых шагов, которые необходимо предпринять для того, чтобы использовать OptionTree включены модуль темы. В коде ниже, я покажу вам основное демо, как включить весь плагин как модуль, который позволит вам иметь самую свежую версию OptionTree без нужды взламывать ядро плагина. Если вы хотите увидеть демонстрационный код, есть каталог с именем <code>theme-mode</code> внутри каталога <code>assets</code> содержащий файл с именем <code>demo-theme-options.php</code>.

source: Step 1: Include the plugin & turn on theme mode.
ru_ru: Шаг 1: Включите плагин и включите режим темы.

source: Download the latest version of <a href="http://wordpress.org/extend/plugins/option-tree/" rel="nofollow" target="_blank">OptionTree</a>.
ru_ru: Скачайте последнюю версию <a href="http://wordpress.org/extend/plugins/option-tree/" rel="nofollow" target="_blank">OptionTree</a>.

source: Unpack the ZIP archive.
ru_ru: Распаковать ZIP-архив.

source: Put the <code>option-tree</code> directory in the root of your theme. For example, the server path would be <code>/wp-content/themes/theme-name/option-tree/</code>.
ru_ru: Положите папку <code>option-tree</code> в корневой каталог вашей темы. Например, путь сервера должен иметь вид <code>/wp-content/themes/theme-name/option-tree/</code>.

source: Add the following code to the beginning of your <code>functions.php</code>.
ru_ru: Добавьте следующий код в ваш файл функций <code>functions.php</code>.

source: It's that simple! You now have OptionTree built into your theme and anytime there's an update to the plugin you just replace the old version and you're good to go..
ru_ru: Это так просто! Теперь у вас есть OptionTree построенный в вашу тему и в любое время произошедших изменениях в плагине вы просто заменить старую версию

source: Step 2: Create Theme Options without using the UI Builder.
ru_ru: Шаг 2: Создайте Настройки Темы без использования Builder UI.

source: Create a file and name it anything you want, maybe <code>theme-options.php</code>, or use the built in file export to create it for you. Remember, you should always check the file for errors before including it in your theme.
ru_ru: Создайте файл и назвите как пожелаете, допустим <code>theme-options.php</code>, или при помощи Экспорта файла. Помните, что вы всегда должны проверять файл на наличие ошибок, прежде чем включать его в вашу тему.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>theme-options.php</code> into which will help keep you file structure nice and tidy.
ru_ru: Кроме того, вы, вероятно, захотите создать каталог с именем <code>includes</code> чтобы разместить в файле <code>theme-options.php</code>, в который поможет сохранить вам файловую структуру аккуратно и понятно.

source: Add a variation of the following code to your <code>theme-options.php</code>. You'll obviously need to fill it in with all your custom array values for contextual help (optional), sections (required), and settings (required).
ru_ru: Добавить вариацию следующего кода в файл <code>theme-options.php</code>. Вам понадобится, чтобы заполнить ее всеми вашими пользовательскими значениями массива для контекстной справки (опционально), секций (обязательно) и параметрами (обязательно).

source: The code below is a boilerplate to get your started. For a full list of the available option types click the "Option Types" tab above. Also a quick note, you don't need to put OptionTree in theme mode to manually create options but you will want to hide the docs and settings as each time you load the admin area the settings be written over with the code below if they've changed in any way. However, this ensures your settings do not get tampered with by the end-user.
ru_ru: Начните с нижеприведенным шаблонным кодом. Для полного списка доступных типов параметров нажмите кнопку "Типы Параметра" на вкладке выше. Также учтите, чтобы вручную создавать параметры, вам не нужно переключать OptionTree в дизайнерский режим, но если вы захотите скрывать документы и настройки при каждой загрузке админки, в настройках должен быть написан нижеуказанный код, если они каким-либо образом измениться. Однако, это гарантирует, что к вашим настройкам не получит доступ конечный пользователь.

source: Sorry, this function does not exist
ru_ru: Извините, эта функция не существует

source: background-repeat
ru_ru: повторение фонового изображения

source: background-attachment
ru_ru: фиксация фонового изображения

source: background-position
ru_ru: расположение фонового изображения

source: Add Media
ru_ru: Добавить медиафайл

source: No Categories Found
ru_ru: Категории не найдены

source: Choose One
ru_ru: Выбрать один

source: No Posts Found
ru_ru: Записи не найдены

source: Add New
ru_ru: Добавить новый

source: You can re-order with drag & drop, the order will update after saving.
ru_ru: Вы можете переупорядочить зацепив-перетащив и сохранить обновление.

source: No Pages Found
ru_ru: Страницы не найдены

source: Choose Sidebar
ru_ru: Выбрать боковую панель (сайдбар)

source: No Sidebars
ru_ru: Без боковой панели

source: No Tags Found
ru_ru: Тэги не найдены

source: No Taxonomies Found
ru_ru: Таксономии не найдены

source: Warning!
ru_ru: Предупреждение!

source: Go to the %s page if you want to save data, this page is for adding settings.
ru_ru: Перейти на %s страницу, если вы хотите сохранить данные, эта страница для добавления параметров.

source: If you're unsure or not completely positive that you should be editing these settings, you should read the %s first.
ru_ru: Если вы не уверены или не полностью уверены, в отношении редактирования этих настроек, вы должны сначала прочитать %s.

source: Things could break or be improperly displayed to the end-user if you do one of the following:
ru_ru: Что-то могло сломаться или неправильно отобразиться для конечного пользователя, если вы выполните одно из следующих действий:

source: Give two sections the same ID, give two settings the same ID, give two contextual help content areas the same ID, don't create any settings, or have a section at the end of the settings list.
ru_ru: Присвойте двум разделам один и тот же идентификатор (ID), присвойте двум настройкам один и тот же идентификатор (ID), присвойте двум содержаниям контекстной справки один и тот же идентификатор (ID), не создавайте никаких настроек или раздела в конце списка параметров.

source: You can create as many settings as your project requires and use them how you see fit. When you add a setting here, it will be available on the Theme Options page for use in your theme. To separate your settings into sections, click the "Add Section" button, fill in the input fields, and a new navigation menu item will be created.
ru_ru: Вы можете создать столько настроек, сколько потребуется вашему проекту и использовать их как захотите. Добавленная здесь настройка будет доступна для использована на странице параметров Темы. Чтобы разделить настройки на разделы, нажмите кнопку "Добавить раздел", заполните поля, и новый пункт меню навигации будет создан.

source: All of the settings can be sorted and rearranged to your liking with Drag & Drop. Don't worry about the order in which you create your settings, you can always reorder them.
ru_ru: Все настройки могут быть отсортированы и переставлены на ваш вкус методом Drag & Drop (зацепи и перетащи). Не беспокойтесь о порядке, в котором вы создаете настройки, вы всегда можете изменить их.

source: Add Section
ru_ru: Добавить Раздел

source: Contextual Help
ru_ru: Контекстная справка

source: Contextual Help Sidebar
ru_ru: Контекстная справка боковой панели

source: If you decide to add contextual help to the Theme Option page, enter the optional "Sidebar" HTML here. This would be an extremely useful place to add links to your themes documentation or support forum. Only after you've added some content below will this display to the user.
ru_ru: Если вы решите добавить контекстную справку к параметрам Темы, введите опциональный код-html "Панель". Это было бы чрезвычайно полезно размещать ссылки на ваши темы в документации или на форуме поддержки. Как только вы добавите контент, ниже он будет виден пользователю.

source: Add Contextual Help Content
ru_ru: Добавить содержание контекстной справки

source: This import method has been deprecated. That means it has been replaced by a new method and is no longer supported, and may be removed from future versions. All themes that use this import method should be converted to use its replacement below.
ru_ru: Этот метод импорта устарел. Это означает, что он был заменен на новый метод и больше не поддерживается, и может быть удален из будущих версий. Все Темы, которые используют этот метод импорта должны быть преобразованы для использования его замены ниже.

source: If you were given a Theme Options XML file with a premium or free theme, locate it on your hard drive and upload that file by clicking the blue upload button. A popup window will appear, upload the XML file and click "Send to OptionTree". The file URL should be in the upload input, if it is click "Import XML".
ru_ru: Когда вы получите XML-файл с настройками для бесплатной или Премиум-Темы, разместите его на ваш жесткий диск и загрузите. Появится окно, где нужно нажать на кнопку "Отправить в OptionTree". URL-адрес файла должен быть в области загрузки и если это так нажмите кнопку "Импорт XML".

source: Import XML
ru_ru: Импортировать XML

source: Add XML
ru_ru: Добавить XML

source: To import your Settings copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Settings" button.
ru_ru: Чтобы импортировать Ваши настройки, скопируйте и вставьте то, что выглядит как случайная строка из алфавитно-цифровых символов в эту текстовую область и нажмите кнопку "Импортировать найстройки".

source: Import Settings
ru_ru: Импортировать Настройки

source: Only after you've imported the Settings should you try and update your Theme Options.
ru_ru: Только после того как вы импортировали настройки вы должны попробовать обновить параметры Темы.

source: To import your Theme Options copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Theme Options" button.
ru_ru: Чтобы импортировать настройки Темы, скопируйте и вставьте случайные символы в это поле и нажмите "Импорт настроек Темы".

source: Import Theme Options
ru_ru: Импортировать Параметры Темы

source: Only after you've imported the Settings should you try and update your Layouts.
ru_ru: Только после импорта Настроек попробуйте обновить макеты.

source: To import your Layouts copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Layouts" button. Keep in mind that when you import your layouts, the active layout's saved data will write over the current data set for your Theme Options.
ru_ru: Чтобы импортировать Макеты скопируйте и вставьте случайные символы в это текстовое поле и нажмите "Импорт Макетов". Имейте в виду, что когда вы импортировать ваши макеты, сохраненные данные активного макета будут заменены текущими данными настроек Темы.

source: Import Layouts
ru_ru: Импортировать Макеты

source: Export your Settings into a fully functional <code>theme-options.php</code> file by clicking this button. For more information on how to use this file read the theme mode %s. Remember, you should always check the file for errors before including it in your theme.
ru_ru: Экспортируйте ваши настройки в полнофункциональный <code>theme-options.php</code> файл, нажав на эту кнопку. Для получения дополнительной информации о том, как использовать этот файл для чтения в режиме темы %s. Помните, что вы всегда должны проверить файл на наличие ошибок, прежде чем включать его в вашу тему.

source: Export Settings File
ru_ru: Экспортировать файл настроек

source: Export your Settings by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Settings</strong> textarea on another web site.
ru_ru: Экспортируйте ваши Настройки, выделив этот текст и копировав/вставив в пустой обычный текстовый файл. Затем сохраните этот файл для импорта в другую установку WordPress позже. Кроме того, можно просто вставить его в текстовую область на другом веб-сайте <code>OptionTree->Настройки->Импорт</code> <strong>Настройки</strong>.

source: Export your Theme Options data by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Theme Options</strong> textarea on another web site.
ru_ru: Экспортируйте ваши Настройки Темы, выделив этот текст и копировав/вставив в пустой обычный текстовый файл. Затем сохраните этот файл для импорта в другую установку WordPress позже. Кроме того, можно просто вставить его в текстовую область на другом веб-сайте <code>OptionTree->Настройки->Импорт</code> <strong>Настройки Темы</strong>.

source: Export your Layouts by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Layouts</strong> textarea on another web site.
ru_ru: Экспортируйте ваши макеты, выделив этот текст и копировав/вставив в пустой обычный текстовый файл. Затем сохраните этот файл для импорта в другую установку WordPress позже. Кроме того, можно просто вставить его в текстовую область на другом веб-сайте <code>OptionTree->Настройки->Импорт</code> <strong>Макеты</strong>.
